tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/pyrolysisRegion/wood
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      wood;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            zeroGradient;
    }

    oneDEmptyPatch
    {
        type            empty;
    }
}


// ************************************************************************* //
